/******************************************************************************

  Copyright (C), 2013-2023, Hisilicon Tech. Co., Ltd.

******************************************************************************
  File Name     : drv_userproc.c
  Version       : Initial Draft
  Author        : Hisilicon multimedia software group
  Created       : 2013/07/01
  Description   : Support user proc function.
  History       :
  1.Date        : 2013/07/01
    Author      : l00185424
    Modification: Created file

******************************************************************************/

/******************************* Include Files *******************************/

/* Sys headers */
#include <linux/module.h>
#include <linux/moduleparam.h>
#include <linux/types.h>
#include <linux/fs.h>
#include <linux/miscdevice.h>
#include <linux/ioctl.h>
#include <linux/mman.h>
#include <linux/uaccess.h>
#include <linux/sched.h>
#include <linux/slab.h>
#include <linux/proc_fs.h>
#include <linux/seq_file.h>
#include <linux/list.h>
#include <asm/atomic.h>
#include <proc/internal.h>

/* Unf headers */
#include "hi_module.h"
#include "hi_debug.h"
#include "hi_common.h"
#include "hi_osal.h"
/* Drv headers */
#include "drv_userproc_ioctl.h"
#include "hi_drv_userproc.h"
#include "hi_drv_proc.h"
#include "hi_kernel_adapt.h"
#include "hi_drv_mem.h"

#ifdef __cplusplus
#if __cplusplus
extern "C"{
#endif
#endif /* __cplusplus */

#if !(0 == HI_PROC_SUPPORT)

/***************************** Macro Definition ******************************/

#if 0
#define UPROC_K_LOCK(sema) \
    do \
    { \
        if (down_interruptible(&sema)) \
        { \
            HI_ERR_UPROC("Lock fail"); \
        } \
    } while (0)

#else
#define UPROC_K_LOCK(sema) do {down(&sema);} while (0)
#endif

#define UPROC_K_UNLOCK(sema) do {up(&sema);} while (0)

/*************************** Structure Definition ****************************/

/*
 * [PATCH linux v2 1/1] fs/proc: use a rb tree for the directory entries
 * http://lists.openwall.net/linux-kernel/2014/10/06/261
 */

typedef struct tagUMP_ENTRY_S
{
	unsigned int hash; //0
	struct rb_node rb_node; //4
    struct proc_dir_entry *parent; //16
    HI_DRV_USRMODEPROC_ENTRY_S stInfo; //20
#if 0
    typedef struct USRMODEPROC_ENTRY_S
    {
        HI_CHAR aszName[MAX_PROC_NAME_LEN + 1];     /* Input, entry name */
        HI_CHAR aszParent[MAX_PROC_NAME_LEN + 1];   /* Input, directory name */
        HI_PROC_SHOW_FN pfnShowFunc; //276
        HI_PROC_CMD_FN pfnCmdFunc;                  /* Input, cmd function */
        HI_VOID * pPrivData;                         /* Input, private data*/
        HI_VOID *pEntry; //288
        HI_VOID *pFile;                             /* Output, Belongs to which file */
        MMZ_BUFFER_S stBuf;                         /* Output, buffer */
    }HI_DRV_USRMODEPROC_ENTRY_S;
#endif
    HI_CHAR entry_name[MAX_PROC_NAME_LEN+1]; //308
    struct list_head entry_node;
}UMP_ENTRY_S;

typedef struct tagUMP_DIR_S
{
	unsigned int hash; //0
	struct rb_node rb_node; //4
	struct rb_root Data_16; //16
    struct file * pstFile; //20
    struct proc_dir_entry *entry; //24
    struct proc_dir_entry *parent; //28
#if 0
    struct list_head dir_node;
    struct list_head entry_list;
#endif
    HI_CHAR dir_name[MAX_PROC_NAME_LEN+12];   /* '_' 1 and pid 10 */ //32
}UMP_DIR_S;

typedef struct tagUMP_PARAM_S
{
#if 0
    int fill[5]; //0
#else
    struct semaphore stSem; /* Semaphore */
    int fill_16; //16
#endif
    wait_queue_head_t wq_for_read; //20
    wait_queue_head_t wq_for_write; //32
    int busy; //44
    HI_DRV_USRMODEPROC_CMD_S current_cmd; //48 +264
    atomic_t atmOpenCnt; //312
#if 0
    /* list of entries */
	struct list_head dir_list;
#endif
}UMP_PARAM_S;

/***************************** Global Definition *****************************/

extern struct proc_dir_entry *g_pHisi_proc;
extern struct proc_dir_entry *g_pCMPI_proc;

/***************************** Static Definition *****************************/

static struct rb_root Data_81109414; //81109414
static UMP_DIR_S *Data_81109540;
static UMP_DIR_S *Data_81109544;

static UMP_PARAM_S g_stUProcParam = 
{
    .atmOpenCnt = ATOMIC_INIT(0),
#if 0
    .dir_list = {&g_stUProcParam.dir_list, &g_stUProcParam.dir_list}
#endif
};

static HI_VOID PROC_RemoveDirForcibly(UMP_DIR_S *pstDir);
static HI_VOID PROC_RemoveEntry(UMP_DIR_S* pstDir, UMP_ENTRY_S * pstEntry);

/*********************************** Code ************************************/

/* nearly complete */
/*static*/ HI_S32 RBTree_Insert_Dirent(int a, UMP_DIR_S * pstDir)
{
	struct rb_node **new = &Data_81109414.rb_node;
