#include <linux/kernel.h>
#include <linux/string.h>
#include <linux/vmalloc.h>
#include <asm/memory.h>
#include <linux/bootmem.h>
#include <linux/gfp.h>
#include <linux/mm.h>
#include <linux/memblock.h>

#include "hi_drv_module.h"
#include "drv_pdm_ext.h"
#include "drv_pq_ext.h"
#include "drv_vpss_ext.h"
#include "drv_win_ext.h"
#include "drv_disp_ext.h"
#include "hi_flash.h"
#include "hi_drv_mem.h"
#include "hi_drv_mmz.h"
#include "drv_pq.h"
#include "hi_osal.h"

#define PQ_NAME                "HI_PQ"

PQ_PARAM_S* g_pstPqParam; //8110AAF8 = 8110aa20 + 216
HI_U32 Data_8110aafc; //8110aafc = 8110aa20 + 220
HI_U32 Data_8110ab00; //8110ab00 = 8110aa20 + 224
HI_BOOL g_bLoadPqBin; //8110B0F4 = 8110aa20 + 1748
MMZ_BUFFER_S g_stPqBinBuf;

struct
{
	PQ_MNG_GetPictureSettingStruct1 Data_0; //0
	PQ_MNG_GetPictureSettingStruct1 Data_8; //8
	PQ_MNG_GetPictureSettingStruct2 Data_16; //16
	HI_U16 wData_28; //28
	HI_U16 wData_30; //30
	HI_U16 wData_32; //32
	HI_U16 wData_34; //34
	HI_U32 Data_36; //36
	HI_U32 Data_40; //40
	HI_U32 Data_44; //44
	HI_U32 Data_48; //48
	HI_U32 Data_52; //52
	HI_U32 Data_56; //56
	HI_U32 Data_60; //60
	HI_U32 Data_64; //64
	HI_U32 Data_68; //68
	HI_U32 Data_72; //72
	HI_U32 Data_76; //76
	HI_U32 Data_80; //80
	HI_U32 Data_84; //84
	HI_U32 Data_88; //88
	HI_U32 Data_92; //92
	HI_U32 Data_96; //96
	HI_U32 Data_100; //100
	HI_U32 Data_104[18]; //104
	HI_U32 Data_176; //176
	HI_U32 Data_180; //180

} Data_8110aa20; //8110aa20


extern PQ_EXPORT_FUNC_S   g_PqExportFuncs;

static HI_S32 PQ_DRV_GetFlashPqBin(PQ_PARAM_S* pstPqParam);


HI_S32 DRV_PQ_SetPQModule(int a, int b)
{
#warning TODO: DRV_PQ_SetPQModule
	printk("DRV_PQ_SetPQModule: TODO\n");
	printk("DRV_PQ_SetPQModule: TODO\n");
	printk("DRV_PQ_SetPQModule: TODO\n");
	printk("DRV_PQ_SetPQModule: TODO\n");
	printk("DRV_PQ_SetPQModule: TODO\n");
	printk("DRV_PQ_SetPQModule: TODO\n");
	printk("DRV_PQ_SetPQModule: TODO\n");
	printk("DRV_PQ_SetPQModule: TODO\n");
	printk("DRV_PQ_SetPQModule: TODO\n");
	printk("DRV_PQ_SetPQModule: TODO\n");
	printk("DRV_PQ_SetPQModule: TODO\n");
	printk("DRV_PQ_SetPQModule: TODO\n");
	printk("DRV_PQ_SetPQModule: TODO\n");
	printk("DRV_PQ_SetPQModule: TODO\n");
	printk("DRV_PQ_SetPQModule: TODO\n");
	printk("DRV_PQ_SetPQModule: TODO\n");
	printk("DRV_PQ_SetPQModule: TODO\n");
	printk("DRV_PQ_SetPQModule: TODO\n");
}


