/*
 * drivers/cpufreq/cpufreq_interactive.c
 *
 * Copyright (C) 2010 Google, Inc.
 *
 * This software is licensed under the terms of the GNU General Public
 * License version 2, as published by the Free Software Foundation, and
 * may be copied, distributed, and modified under those terms.
 *
 * This program is distributed in the hope that it will be useful,
 * but WITHOUT ANY WARRANTY; without even the implied warranty of
 * MERCHANTABILITY or FITNESS FOR A PARTICULAR PURPOSE.  See the
 * GNU General Public License for more details.
 *
 * Author: Mike Chan (mike@android.com)
 *
 */

#include <linux/cpu.h>
#include <linux/cpumask.h>
#include <linux/cpufreq.h>
#include <linux/module.h>
#include <linux/moduleparam.h>
#include <linux/rwsem.h>
#include <linux/sched.h>
#include <linux/tick.h>
#include <linux/time.h>
#include <linux/timer.h>
#include <linux/workqueue.h>
#include <linux/kthread.h>
#include <linux/slab.h>
#include <linux/kernel_stat.h>
#include <asm/cputime.h>

#include <linux/sched/rt.h>

#define CREATE_TRACE_POINTS
#include <trace/events/cpufreq_interactive.h>

static int active_count;

struct cpufreq_interactive_cpuinfo {
	struct timer_list cpu_timer; //0
	struct timer_list cpu_slack_timer; //28
	spinlock_t load_lock; /* protects the next 4 fields */ //56
	u64 time_in_idle;
	u64 time_in_idle_timestamp;
	u64 cputime_speedadj;
	u64 cputime_speedadj_timestamp;
	struct cpufreq_policy *policy; //96
	struct cpufreq_frequency_table *freq_table;
	unsigned int target_freq; //104
	unsigned int floor_freq;
	u64 floor_validate_time;
	u64 hispeed_validate_time;
	struct rw_semaphore enable_sem; //128
	int governor_enabled;
};

typedef struct cpufreq_interactive_tunables
{
	int Data_0; //0
	unsigned int hispeed_freq; //4
	unsigned int Data_8/*go_hispeed_load*/; //8
	spinlock_t Data_12/*target_loads_lock*/; //12
	int* Data_16/*target_loads*/; //16
	int Data_20/*ntarget_loads*/; //20
	int Data_24; //24
	int Data_28/*timer_rate*/; //28
	spinlock_t Data_32; //32
	int* Data_36; //36
	int Data_40/*nabove_hispeed_delay*/; //40
	int Data_44/*boost_val*/; //44
	int Data_48/*boostpulse_duration_val*/; //48
	u64 boostpulse_endtime; //56
	int Data_64/*timer_slack_val*/; //64
	bool io_is_busy; //68
} Struct_810f3bc8;

static Struct_810f3bc8* Data_810f3bc8; //810f3bc8

//static int Data_80f9c810 = 20000; //80f9c810
//static int Data_80f9c814 = 80; //80f9c814

static DEFINE_PER_CPU(struct cpufreq_interactive_cpuinfo, cpuinfo);

/* realtime thread handles frequency scaling */
static struct task_struct *speedchange_task; //810f3be8
static cpumask_t speedchange_cpumask;
static spinlock_t speedchange_cpumask_lock; //810f3bcc
static struct mutex gov_lock;

/* Hi speed to bump to from lo speed when load burst (default max) */
static unsigned int hispeed_freq;

#if 0 //STC2HI: TODO
/* Go to hi speed when CPU load at or above this value. */
#define DEFAULT_GO_HISPEED_LOAD CONFIG_DEFAULT_GO_HISPEED_LOAD
static unsigned long go_hispeed_load = DEFAULT_GO_HISPEED_LOAD;
#endif

/* Target load.  Lower values result in higher CPU speeds. */
#define DEFAULT_TARGET_LOAD 80 //CONFIG_DEFAULT_TARGET_LOAD
