
/******************************************************************************

  Copyright (C), 2001-2013, Hisilicon Tech. Co., Ltd.

******************************************************************************
  File Name       	       :      optm_hifb.c
  Version        		: 	Initial Draft
  Author         		: 	Hisilicon multimedia software group
  Created       		:
  Description  	       :      optimus prime 
  History       		:
  1.Date        		       :
  Author      		       :
  Modification   	       :	Created file

******************************************************************************/
#ifndef HI_BUILD_IN_BOOT
#include <linux/string.h>
#include <linux/fb.h>

#include <linux/time.h>
#include <linux/version.h>
#include <linux/module.h>
#include <linux/types.h>
#include <linux/errno.h>
#include <linux/fcntl.h>
#include <linux/mm.h>
#include <linux/miscdevice.h>
#include <linux/proc_fs.h>
#include <linux/fs.h>
#include <linux/slab.h>
#if (LINUX_VERSION_CODE < KERNEL_VERSION(2, 6, 36))
#include <linux/smp_lock.h>
#endif 
#include <linux/init.h>
#include <linux/delay.h>
#include <asm/uaccess.h>
#include <asm/io.h>
#include <asm/system.h>
#include <linux/interrupt.h>
#include <linux/ioport.h>
#include <linux/string.h>
#include <linux/workqueue.h>

#include "hi_module.h"
#include "hi_drv_module.h"
#include "drv_disp_ext.h"
#else
#include "drv_display.h"
#include "hifb_debug.h"
#endif
#include "optm_hal.h"
#include "optm_hifb.h"
#include "optm_alg_csc.h"
#include "optm_alg_gzme.h"
#include "optm_alg_gsharp.h"
#include "hi_drv_disp.h"

/******************************************************************
                    definitions of functional switches
******************************************************************/
#ifndef HI_BUILD_IN_BOOT
static DISP_EXPORT_FUNC_S *ps_DispExportFuncs = HI_NULL; //81143418
#else
static HI_U32             *ps_DispExportFuncs = HI_NULL;
#endif

#define CFG_HIFB_S40V2_PALNTSC_BUG

#ifdef HI_BUILD_IN_BOOT
#define HIFB_ERROR   printf
#define HIFB_WARNING printf
#define HIFB_INFO(fmt...)
#define HIFB_FATAL   printf
#endif

/* wait v blanking */
#define OPTM_HIFB_WVM_ENABLE 1

/*  call-back after registers' update */
#define OPTM_HIFB_GFXRR_ENABLE 1


#define OPTM_MAX_LOGIC_HIFB_LAYER ((HI_U32)HIFB_LAYER_ID_BUTT) //13

OPTM_ALG_GZME_MEM_S  GfxZmeModule; //81143454

#define DispWidth_HD  1280
#define DispHeight_HD 720

#define DispWidth_SD  720
#define DispHeight_SD 576

#define OPTM_ENABLE  1
#define OPTM_DISABLE 0

#define OPTM_COLOR_DEFVALUE 50

#define OPTM_EXTRACTLINE_RATIO 4
#define OPTM_EXTRACTLINE_WIDTH 1080
#define OPTM_MASTER_GPID OPTM_GFX_GP_0
#define OPTM_SLAVER_GPID OPTM_GFX_GP_1
#define OPTM_SLAVER_LAYERID HIFB_LAYER_SD_0
#define OPTM_CURSOR_LAYERID HIFB_LAYER_SD_1 //HIFB_LAYER_HD_3????



/******************************************************************
                    definitions of data format
******************************************************************/
typedef union _OPTM_GFX_UP_FLAG_U
{
    /*  Define the struct bits */
    struct
    {
        unsigned int    RegUp       : 1 ; /*  [0] */
        unsigned int    Enable      : 1 ; /*  [1] */
        unsigned int    InRect      : 1 ; /*  [2] */
        unsigned int    OutRect     : 1 ; /*  [3] */
        unsigned int    Alpha       : 1 ; /*  [4] */
        unsigned int    PreMute     : 1 ; /*  [5] */
		unsigned int    WbcMode     : 1 ; /*  [6] */
        unsigned int    Reserved    : 25; /*  [31...7] */
    } bits;

    /*  Define an unsigned member */
    unsigned int    u32;
}OPTM_GFX_UP_FLAG_U;


typedef struct tagOPTM_GFX_LAYER_S{
    HI_BOOL              bOpened; //0 (2560)
    HI_BOOL              bMaskFlag;		
	HI_BOOL              bSharpEnable;
	HI_BOOL              bExtractLine;
	/*******backup hardware data of gfx*********/
	HI_BOOL              bEnable; //16
	HI_BOOL              b3DEnable;
	HI_BOOL              bPreMute;
    int fill1[1]; //????
	HI_U32               u32ZOrder; //32
	HI_BOOL              bCampEnable; //36
    HI_BOOL              bBufferChged;    
    HI_U32               s32BufferChgCount;        
    HI_U32               NoCmpBufAddr;
	HI_U32               u32TriDimAddr;
    int fill2[1]; //????
    HI_U16               Stride; //60         /* no compression mode stride*/
    HI_U16               CmpStride;       /* compression mode stride     */
	HIFB_COLOR_FMT_E     enDataFmt;
	HIFB_RECT            stInRect;        /*Inres of gfx*/
    HIFB_ALPHA_S         stAlpha;
	HIFB_COLORKEYEX_S    stColorkey;
	HIFB_STEREO_MODE_E   enTriDimMode;
	OPTM_VDP_BKG_S       stBkg; //128
	OPTM_VDP_GFX_BITEXTEND_E enBitExtend; //148
	OPTM_VDP_DATA_RMODE_E    enReadMode; //152
	OPTM_VDP_DATA_RMODE_E    enUpDateMode; //156
	/*****************end**********************/	
	
	OPTM_VDP_LAYER_GFX_E      enGfxHalId; //160   /*the gfx's hal id*/
	OPTM_GFX_GP_E        enGPId; //164 /*which gp the gfx belong to*/
   
    OPTM_CSC_STATE_E     CscState; //168

	volatile HI_U32      vblflag;
	wait_queue_head_t    vblEvent; //176
    MMZ_BUFFER_S         stCluptTable; //188
    //200
}OPTM_GFX_LAYER_S;

typedef enum tagOPTM_WBC_MODE_E{
	OPTM_WBC_MODE_MONO      = 0x0,
	OPTM_WBC_MODE_LFET_EYE  = 0x10,
	OPTM_WBC_MODE_RIGHT_EYE = 0x11,
	OPTM_WBC_MODE_BUTT,
}OPTM_WBC_MODE_E;

typedef enum tagOPTM_VDP_CONNECT_E
{
    OPTM_VDP_CONNECT_G3_DHD0 = 0, 
    OPTM_VDP_CONNECT_G3_DHD1    ,

    OPTM_VDP_CONNECT_BUTT       ,
}OPTM_VDP_CONNECT_E;



typedef struct tagOPTM_GFX_WBC_S{
    HI_BOOL                bOpened; //0
    HI_BOOL                bEnable; //4

    OPTM_VDP_LAYER_WBC_E        enWbcHalId; //8
    /* setting */
    HI_S32                 s32BufferWidth; //12
    HI_S32                 s32BufferHeight; //16
    HI_U32                 u32BufferStride; //20
    int 				   Data_24; //24
    int					   Data_28; //28
    int 				   Data_32; //32
    int					   Data_36; //36
    int 				   Data_40; //40
    MMZ_BUFFER_S           stFrameBuffer; //44

    HI_U32                 u32DataPoint; //56 /* 0, feeder; others, reserve */

    HIFB_COLOR_FMT_E       enDataFmt; //60

    HIFB_RECT              stInRect; //64???
    HI_BOOL                bInProgressive; //80???
    HIFB_RECT              stOutRect; //84???
    HI_BOOL                bOutProgressive; //100???
    HI_U32                 u32BtmOffset; //104???
    HI_BOOL                bHdDispProgressive; //108???
	OPTM_VDP_DITHER_E      enDitherMode; //112
	OPTM_VDP_WBC_OFMT_E    stWBCFmt; //116
	OPTM_VDP_DATA_RMODE_E  enReadMode; //120
	OPTM_WBC_MODE_E        enWbcMode; //124
	HI_U32 Data_128; //128
	//132
}OPTM_GFX_WBC_S;

/* display ID */
typedef enum tagOPTM_DISPCHANNEL_E
{
    OPTM_DISPCHANNEL_0 = 0,//gfx4,gfx5
    OPTM_DISPCHANNEL_1,    //gfx0,gfx1,gfx2,gfx3
    OPTM_DISPCHANNEL_BUTT
}OPTM_DISPCHANNEL_E;

#ifndef HI_BUILD_IN_BOOT
typedef struct tagOPTM_GFX_WORK_S
{
	HI_U32                   u32Data;
	struct work_struct       work; 
}OPTM_GFX_WORK_S;
#endif

typedef struct tagOPTM_GFX_GP_S
{
	/*Frame format of Output: 0-field; 1-frame*/
	HI_BOOL bOpen;     //the flag of gp initial
	HI_BOOL b3DEnable;   // 3D flag
	HI_BOOL bMaskFlag;
	HI_BOOL bBGRState; //12
	HI_BOOL bInterface;
	HI_BOOL bGpClose; //20
	HI_BOOL bRecoveryInNextVT; //24
	/*wether need to extract line or not*/
	HI_BOOL bNeedExtractLine;
	/*gp_in size setted by usr*/
	HI_BOOL bGPInSetbyusr;
	/*gp_in size got initial by the first opened layer */
	HI_BOOL bGPInInitial;
	/*disp initial*/
	HI_BOOL bDispInitial; //40

	HI_RECT_S stInRect;
	HI_RECT_S stOutRect;

	HIFB_STEREO_MODE_E        enTriDimMode;

	int fill; //???
	/*  about color  */
	OPTM_COLOR_SPACE_E        enInputCsc; //84
	OPTM_COLOR_SPACE_E        enOutputCsc; //88
	OPTM_GFX_CSC_PARA_S       stCscPara;

	OPTM_VDP_LAYER_GP_E       enGpHalId; //120
	OPTM_DISPCHANNEL_E        enDispCh; //124

    OPTM_GFX_UP_FLAG_U        unUpFlag;
	/*declare work queue to open slv layer*/
#ifndef HI_BUILD_IN_BOOT
	struct workqueue_struct   *queue; //132
	OPTM_GFX_WORK_S           stOpenSlvWork;
	OPTM_GFX_WORK_S           st3DModeChgWork;
#endif

	/***save for disp change and suspend***/
	HI_U32 u32Prior; //176
	HI_U32 u32Alpha; //180
	OPTM_VDP_DATA_RMODE_E enReadMode; //184
	OPTM_VDP_BKG_S        stBkg; //188
	OPTM_VDP_CBM_MIX_E 	  enMixg; //208
	//212
}OPTM_GFX_GP_S;

typedef struct tagOPTM_GFX_IRQ_S
{    
    HI_U32 u32Param0;
    HI_U32 u32Param1;
	IntCallBack pFunc;
}OPTM_GFX_IRQ_S;

typedef struct tagOPTM_GFX_CALLBACK_S
{   
	/*each bit: 0---no irq,1---irq
	0---HIFB_CALLBACK_TYPE_VO
	1---HIFB_CALLBACK_TYPE_3DMode_CHG
	2---HIFB_CALLBACK_TYPE_REGUP
	*/
	HI_U32  u32CTypeFlag; 
	OPTM_GFX_IRQ_S stGfxIrq[HIFB_CALLBACK_TYPE_BUTT];
}OPTM_GFX_CALLBACK_S;


#define OPTM_GP_MAXGFXCOUNT 3
typedef struct tagOPTM_GP_IRQ_S
{
	/*Gp only need to register callback func to disp once*/
    HI_BOOL bRegistered[111]/*[HI_DRV_DISP_C_TYPE_BUTT]*/; //0
	
	OPTM_GFX_CALLBACK_S stGfxCallBack[OPTM_GP_MAXGFXCOUNT];
//	int fill[110]; //?????
	//1068
}OPTM_GP_IRQ_S;

/******************************************************************
               capacity set definitions
******************************************************************/
